u1n11/M55M1_Mix_ZO_Trainer/SampleCode/MachineLearning/ImageClassification/Model/inference_mngt.cpp
    resizeImg.w      = inputImgCols;
    resizeImg.h      = inputImgRows;
    resizeImg.data   = (uint8_t *)inputTensor->data.data;
    resizeImg.pixfmt = PIXFORMAT_RGB888;

    imlib_nvt_scale(&frameBuffer, &resizeImg, &roi);

    if (!preProcess->DoPreProcess(resizeImg.data,
                                  (resizeImg.w * resizeImg.h * inputChannels)))
    {
        printf_err("[ZO] Pre-processing failed\r\n");
        extern bool frameBufferFrozen;
        frameBufferFrozen = false;
        return;
    }

    /* Run feature extractor (NPU) */
    if (!extractorModel.RunInference())
    {
        printf_err("[ZO] Feature extractor failed\r\n");
        extern bool frameBufferFrozen;
        frameBufferFrozen = false;
        return;
    }

    /* Copy features → classifier input */
    TfLiteTensor *extOutput = extractorModel.GetOutputTensor(0);
    TfLiteTensor *clsInput  = classifierModel.GetInputTensor(0);
    std::memcpy(clsInput->data.data, extOutput->data.data, extOutput->bytes);

    /* Cache FC input vector — runs classifier once, no more NPU calls in TrainStep */
    if (!zoTrainer->CacheFeature(classifierModel))
    {
        printf_err("[ZO] CacheFeature failed\r\n");
        frameBufferFrozen = false;
        return;
    }

    /* ---- Run one ZO training step (CPU-only node perturbation) ---- */
    extern uint32_t SystemCoreClock;
    uint64_t t0 = pmu_get_systick_Count();

    float loss = (zoMethod == ZO_METHOD_WP)
                 ? zoTrainer->TrainStepWP(classifierModel, zoTargetLabel,
                                          zoLearningRate, zoNumPerturbations)
                 : zoTrainer->TrainStep(classifierModel, zoTargetLabel,
                                        zoLearningRate, zoNumPerturbations);

    uint64_t elapsed_cyc = pmu_get_systick_Count() - t0;
    uint32_t elapsed_us  = (uint32_t)(elapsed_cyc * 1000000ULL / SystemCoreClock);

    /* Device reports raw per-step measurements only; the external host decides
     * convergence/stopping from this log series. No on-device judgement here. */
    const ZOTrainer::StepMetrics& m = zoTrainer->GetLastMetrics();
    (void)loss; /* full A→B series is in the metrics struct */
    const std::string& labelName = labels[(size_t)zoTargetLabel];
    const char* methodName = (zoMethod == ZO_METHOD_WP) ? "WP" : "NP";
    info_critical("[FRAME: %u] [ZO] Step %d | method=%s | target=%s(%d) | loss=%.4f->%.4f | loss_ema=%.4f | "
                  "delta_params=%.2f%% | grad_norm=%.4f | lr=%.6f | Q=%d | Time: %.2fms | Mem: %zu bytes\r\n",
         inferenceFrameCount,
         zoTrainer->GetStepCount(),
         methodName,
         labelName.c_str(), zoTargetLabel,
         m.loss_before, m.loss_after,
         m.loss_ema,
         m.delta_params * 100.0f,
         m.grad_norm,
         zoLearningRate, zoNumPerturbations,
         elapsed_us / 1000.0f,
         zoTrainer->GetMemoryUsed());

    info_if_token(LOG_ZO_TRAINING, "[ZO] Snapshot not auto-saved. Send 'zo_save' to persist to APROM flash.\r\n");

    /* Unfreeze frameBuffer after training completes */
    frameBufferFrozen = false;
}

int ISM_ZO_SaveToFlash(void)
{
    return SaveZOTrainerSnapshotToFlash() ? 1 : 0;
}

int ISM_ZO_ClearFlash(void)
{
    if (!FlashErasePages(kZoFlashRegionAddr, kZoFlashRegionBytes))
    {
        printf_err("[ZO] Failed to erase persisted snapshot from APROM flash\r\n");
        return 0;
    }

    g_zoLoadedFromFlash = false;
    g_zoPersistedTrainSteps = 0;
    info_critical("[ZO] Persisted snapshot erased from flash @0x%08X\r\n", kZoFlashRegionAddr);
    return 1;
}

void ISM_ZO_PrintStatus(void)
{
    if (!zoTrainer || !zoTrainer->IsInitialized())
    {
        info("[ZO] Status: trainer=NOT_INITIALISED\r\n");
        return;
    }

    const char *source = g_zoLoadedFromFlash ? "FLASH" : "BUILTIN";
    info_critical("[ZO] Status: trainer=READY, source=%s, runtime_steps=%d, flash_steps=%u\r\n",
                  source, zoTrainer->GetStepCount(), g_zoPersistedTrainSteps);
}

#endif /* USE_SPLIT_MODEL */

/* ------------------------------------------------------------------ */
/*  DoGraphDump - Traverse TFLite model graph structure               */
/* ------------------------------------------------------------------ */
#if !(defined(USE_SPLIT_MODEL) && (USE_SPLIT_MODEL == 1))
static void DoGraphDump(void)
{
    /* Graph dump reads FlatBuffer directly — does NOT require model.Init() */

    /* Print basic model info manually */
    const uint8_t *modelPtr = arm::app::mobilenet::GetModelPointer();
    printf("Model Address: %p\r\n", modelPtr);
    printf("Model Size:    %zu bytes\r\n", arm::app::mobilenet::GetModelLen());

    /* Now do detailed FlatBuffer traversal */
    const tflite::Model *fbModel = ::tflite::GetModel(modelPtr);
    if (!fbModel || !fbModel->subgraphs() || fbModel->subgraphs()->size() == 0)
    {
        printf("[ISM] Invalid model FlatBuffer\r\n");
        return;
    }

    const tflite::SubGraph *subgraph = fbModel->subgraphs()->Get(0);
    const auto *tensors   = subgraph->tensors();
    const auto *operators  = subgraph->operators();
    const auto *opcodes    = fbModel->operator_codes();

    /* ---- Tensor Table ---- */
    printf("\r\n========== TENSOR TABLE (%d tensors) ==========\r\n",
         tensors ? (int)tensors->size() : 0);

    if (tensors)
    {
        for (uint32_t t = 0; t < tensors->size(); t++)
        {
            const tflite::Tensor *tensor = tensors->Get(t);
            const char *name = tensor->name() ? tensor->name()->c_str() : "(unnamed)";
            const char *typeName = tflite::EnumNameTensorType(tensor->type());

            printf("  T[%3" PRIu32 "] %-10s ", t, typeName);

            /* Print shape */
            if (tensor->shape() && tensor->shape()->size() > 0)
            {
                printf("shape=[");
                for (uint32_t s = 0; s < tensor->shape()->size(); s++)
                {
                    if (s > 0) printf(",");
                    printf("%d", tensor->shape()->Get(s));
                }
                printf("] ");
            }
            printf("%s\r\n", name);
        }
    }

